# Parte 2
Se ha cometido un delito y la policía necesita su ayuda. Un detective te dio el informe de la
escena del crimen, pero de alguna manera lo perdiste. Recuerdas vagamente que el crimen fue
un asesinato que ocurrió en algún momento del 15 de enero de 2018 y que tuvo lugar en SQL
City. Empiece por recuperar el informe de la escena del crimen correspondiente de la base de
datos del departamento de policía.

In [132]:
import sqlite3
import pandas as pd

con = sqlite3.connect("./sql-murder-mystery.db")

## creamos la conexion

In [8]:
query = """
SELECT 
    name
FROM 
    sqlite_master 
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';
"""

pd.read_sql(query,con)

                     name
0      crime_scene_report
1         drivers_license
2                  person
3  facebook_event_checkin
4               interview
5      get_fit_now_member
6    get_fit_now_check_in
7                  income
8                solution

## Hacemos un query para obtener el reporte de la escena del crimen

In [133]:
query = """
SELECT 
    *
FROM 
    crime_scene_report
WHERE 
    type = "murder"
    AND
    city = "SQL City"
    AND 
    date = 20180115
"""

x = pd.read_sql(query,con)
x

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witnesses. The first witness lives at the last house on...,SQL City

## seleccionamos para poder leer el reporte completo

In [52]:
x.iloc[0,2]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

##  En base a la informacion de los testigos, los buscamos en la tabla person

In [77]:
query = """
SELECT 
    *
FROM 
    person
WHERE 
    (name like "%Annabel%"
    AND 
    address_street_name = "Franklin Ave") 
    OR
    (
    address_number = (
        SELECT MAX(address_number)
        FROM person
        WHERE address_street_name = "Northwestern Dr"
        )
    )
"""

pd.read_sql(query,con)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
1,16371,Annabel Miller,490173,103,Franklin Ave,318771143

## Buscamos si hay entrevistas de los testigos

In [134]:
query = """
SELECT 
    *
FROM 
    interview
WHERE
    person_id in (16371,14887)
"""

x = pd.read_sql(query,con)
x

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership num..."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last wee..."

In [89]:
x.iloc[0,1]

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [90]:
x.iloc[1,1]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

## Habiendo leido las entrevistas de los testigos, buscamos en get_fit_now_member para encontrar a nuestros sospechosos preeliminares

In [101]:
query = """
SELECT 
    *
FROM 
    get_fit_now_member gfm
INNER JOIN 
    get_fit_now_check_in gfch ON (gfm.id = gfch.membership_id)
WHERE 
    id LIKE "48Z%"
    AND 
    membership_status = "gold"
    AND
    check_in_date = 20180109

"""

pd.read_sql(query,con)

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time
0,48Z7A,28819,Joe Germuska,20160305,gold,48Z7A,20180109,1600,1730
1,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700

## Teniendo estos sospechosos, intentamos matchearlos con la informacion del auto que vio el primer testigo

In [136]:
query = """
SELECT 
    *
FROM 
   drivers_license dl
JOIN 
    person p ON (p.license_id = dl.id)
WHERE 
    plate_number LIKE "%H42W%"
    AND 
    p.id IN (67318,28819)

"""

pd.read_sql(query,con)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model,id,name,license_id,address_number,address_street_name,ssn
0,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

## Habiendo usado la info de los testigos y encontrado un sospechoso principal, probamos

In [138]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Jeremy Bowers')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

"Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villian behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer."

## Buscamos la entrevista del testigo

In [111]:
query = """
SELECT 
    *
FROM 
    interview
WHERE
    person_id IN (28819,67318)
"""

x = pd.read_sql(query,con)
x

,person_id,transcript
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (..."

In [113]:
x.iloc[0,1]

'I was hired by a woman with a lot of money. I don\'t know her name but I know she\'s around 5\'5" (65") or 5\'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n'

## Con la info de la entrevista del culpable buscamos a un entre las tablas person, income, drivers_license, y facebook_event_checkin sospechosos que hagan match con la descripcion

In [142]:
query = """
SELECT 
    *
FROM 
    person p
JOIN 
    drivers_license dl ON (dl.id = p.license_id)
JOIN
    income i ON (p.ssn = i.ssn)
JOIN 
    facebook_event_checkin ec ON (p.id = ec.person_id)
WHERE
    height BETWEEN 65 AND 67
    AND 
    hair_color = "red"
    AND 
    car_make = "Tesla"
    
GROUP BY name
"""
pd.read_sql(query,con)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,...,gender,plate_number,car_make,car_model,ssn,annual_income,person_id,event_id,event_name,date
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,202298,68,66,green,...,female,500123,Tesla,Model S,987756388,310000,99716,1143,SQL Symphony Concert,20171206

## Ya que solo encontramos 1 persona que matchea toda la info, probamos

In [143]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

'Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!'

# :)